#Область ОбработчикиHTTPСервиса

Функция HealthGET(Запрос)

	Возврат мкпМаршрутизатор.ОбработатьЗапрос(Запрос);

КонецФункции

Функция MetaGET(Запрос)

	Возврат мкпМаршрутизатор.ОбработатьЗапрос(Запрос);

КонецФункции

Функция MetaSearchGET(Запрос)

	Возврат мкпМаршрутизатор.ОбработатьЗапрос(Запрос);

КонецФункции

Функция MetaObjectGET(Запрос)

	Возврат мкпМаршрутизатор.ОбработатьЗапрос(Запрос);

КонецФункции

Функция DataCollectionGET(Запрос)

	Возврат мкпМаршрутизатор.ОбработатьЗапрос(Запрос);

КонецФункции

Функция DataItemGET(Запрос)

	Возврат мкпМаршрутизатор.ОбработатьЗапрос(Запрос);

КонецФункции

#КонецОбласти
